Tekla.Structures.Model.IGeometryNode
The IGeometryNode interface represents geometry tree node. This is implemented by concrete classes for the various types of geometry nodes

Tekla.Structures.Model.IGeometryNode.IsAutomatic
Gets a value indicating whether this geometry node was automatically generated (i.e. false if it was originally a user-defined part)

Tekla.Structures.Model.IGeometryNode.AcceptVisitor(Tekla.Structures.Model.IGeometryNodeVisitor)
Entry method for the visitor pattern
visitor:

Tekla.Structures.Model.IGeometryNode.Clone
Creates a new object that is a copy of the current instance.
Returns: A new object that is a copy of the current instance.